Notes.org
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto html-preamble:t html-scripts:t
#+OPTIONS: html-style:t html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION: My wingding notes for our Kotlin iteration
#+KEYWORDS:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+TITLE: Wingdings Kotlin Notes
#+SUBTITLE:
#+INFOJS_OPT:
#+CREATOR: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 9.1.1)
#+LATEX_HEADER:
#+SETUPFILE: ../../theme-readtheorg.setup

This is a windings iteration covering the [[https://kotlinlang.org][Kotlin progamming language]]. This iteration
started in September 2017 and will probably run to the end of the year.

I am using emacs [[https://github.com/Emacs-Kotlin-Mode-Maintainers/kotlin-mode][kotlin-mode]] and [[https://github.com/zweifisch/ob-kotlin][ob-kotlin]] for code evalution though I have been unable to
get it to evaluate kotlin code in this file without hanging.

Here are the emacs key bindings for kotlin-mode

| Key     | Function                        |
|---------+---------------------------------|
| C-c C-z | Start REPL                      |
| C-c C-n | Send current line to REPL       |
| C-c C-r | Send selected region to REPL    |
| C-c C-c | Send current code block to REPL |
| C-c C-b | Send whole buffer to REPL       |

* Session 1
  I didn't start these notes until the end of session 2.
* Session 2

  #+BEGIN_SRC kotlin :tangle foo.kt
    interface Foo {
       val count: Int
    }

    class Bar1(override val count: Int) : Foo

    class Bar2 : Foo {
       override var count: Int = 0
    }
  #+END_SRC

  We end things after the Extensions section

* Session 3
   Covers the remains of "Classes and Objects" from [[https://kotlinlang.org/docs/reference/data-classes.html][Data Classes]] through [[https://kotlinlang.org/docs/reference/delegated-properties.html][Delegated
   Properties]]. It was on October 25 and was moderated by Terry.

** Data Classes

   - Note taken on [2017-10-25 Wed 19:15] \\
     Eric suggested that you would need the =componentN= functions to implement
     destructuring. This seems right.

    This is a data class. It's like a c =struct= I guess.
    #+BEGIN_SRC kotlin :tangle src/session3/DataClass.kt
      data class User(val name: String, val age: Int)

      fun main(args: Array<String>) {
         val u = User("Stan", 19)
         println(u)
      }
    #+END_SRC

    You get =toString()=, =equals()= and =hashCode()= for free. Similar to =defrecord= in
    clojure I guess.

    #+BEGIN_SRC clojure :tangle src/session3/defrec.clj
      (defrecord User [name age])

      (def u (->User "Stan" 19))
      ;; or
      (def u (map->User {:name "Stan" :age 19}))

      (println u)
    #+END_SRC

    I don't understand the purpose of the =componentN()= functions. I can't think if a
    reason you'd need them. If you know the position of an argument, you almost certainly
    also know it's name (e.g. =foo.field('fieldname')=, ala python). Otherwise, you just
    want a comprehension of the fields (e.g. =foreach(foo.fields) {...}=). Maybe there is
    some obscure case for this I'm not aware of.


** Sealed Classes
    These are like =enum= classes in java? but you can have multiple instances.

    #+BEGIN_SRC kotlin
      sealed class Expr
      data class Const(val number: Double) : Expr()
      data class Sum(val e1: Expr, val e2: Expr) : Expr()
      object NotANumber : Expr()

    #+END_SRC

    I'm not sure how this is like an enum. It seems more like a marker interface (like
    java's =Serializable=).

** Generics
    Kotlin infers generic parameters if possible:

    #+BEGIN_SRC kotlin
      class Box<T>(t: T) {
              var value = t
      }

      val box = Box(1)

      // It knows that the 1 is an Int
    #+END_SRC

    I've never been completely convinced of the value of generics especially as it relates
    to inheritance relationships. As a result, this section kind of flows over my head a
    bit. You have "declaration-site variance." Great!

