Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-08 Wed 12:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wingdings Kotlin Notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Stan Dyck" />
<meta name="description" content="My wingding notes for our Kotlin iteration"
 />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Wingdings Kotlin Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7788fc0">1. Session 1</a></li>
<li><a href="#org7ac6cc1">2. Session 2</a></li>
<li><a href="#orgce09e52">3. Session 3</a>
<ul>
<li><a href="#orged5458e">3.1. Data Classes</a></li>
<li><a href="#org40d7c6b">3.2. Sealed Classes</a></li>
<li><a href="#orgf9f15b0">3.3. Generics</a>
<ul>
<li><a href="#org7ae8bdb">3.3.1. <span class="done DONE">DONE</span> Come back to this section</a></li>
</ul>
</li>
<li><a href="#orgf0b94e4">3.4. Nested Classes</a></li>
<li><a href="#orgc0713ec">3.5. Enum Classes</a></li>
<li><a href="#org577f46a">3.6. Object Expressions and Declarations</a></li>
</ul>
</li>
<li><a href="#org9a63d54">4. Session 4</a>
<ul>
<li><a href="#orgb6ab07d">4.1. Class Delegation</a></li>
<li><a href="#orgd9462b6">4.2. Delegated Properties</a></li>
<li><a href="#org73791ec">4.3. Functions</a></li>
<li><a href="#org4425524">4.4. Lambdas</a></li>
<li><a href="#org4073eaa">4.5. Inline Functions</a></li>
<li><a href="#orgf8aeeb4">4.6. Coroutines</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is a windings iteration covering the <a href="https://kotlinlang.org/">Kotlin progamming language</a>. This iteration
started in September 2017 and will probably run to the end of the year.
</p>

<p>
I am using emacs <a href="https://github.com/Emacs-Kotlin-Mode-Maintainers/kotlin-mode">kotlin-mode</a> and <a href="https://github.com/zweifisch/ob-kotlin">ob-kotlin</a> for code evalution though I have been unable to
get it to evaluate kotlin code in this file without hanging.
</p>

<p>
Here are the emacs key bindings for kotlin-mode
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c C-z</td>
<td class="org-left">Start REPL</td>
</tr>

<tr>
<td class="org-left">C-c C-n</td>
<td class="org-left">Send current line to REPL</td>
</tr>

<tr>
<td class="org-left">C-c C-r</td>
<td class="org-left">Send selected region to REPL</td>
</tr>

<tr>
<td class="org-left">C-c C-c</td>
<td class="org-left">Send current code block to REPL</td>
</tr>

<tr>
<td class="org-left">C-c C-b</td>
<td class="org-left">Send whole buffer to REPL</td>
</tr>
</tbody>
</table>

<div id="outline-container-org7788fc0" class="outline-2">
<h2 id="org7788fc0"><span class="section-number-2">1</span> Session 1</h2>
<div class="outline-text-2" id="text-1">
<p>
I didn't start these notes until the end of session 2.
</p>
</div>
</div>
<div id="outline-container-org7ac6cc1" class="outline-2">
<h2 id="org7ac6cc1"><span class="section-number-2">2</span> Session 2</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #7CB8BB;">Foo</span> {
   <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">count</span>: <span style="color: #7CB8BB;">Int</span>
}

<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Bar1</span>(<span style="color: #F0DFAF; font-weight: bold;">override</span> <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">count</span>: <span style="color: #7CB8BB;">Int</span>) : <span style="color: #7CB8BB;">Foo</span>

<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Bar2</span> : <span style="color: #7CB8BB;">Foo</span> {
   <span style="color: #F0DFAF; font-weight: bold;">override</span> <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">count</span>: <span style="color: #7CB8BB;">Int</span> = 0
}
</pre>
</div>

<p>
We end things after the Extensions section
</p>
</div>
</div>

<div id="outline-container-orgce09e52" class="outline-2">
<h2 id="orgce09e52"><span class="section-number-2">3</span> Session 3</h2>
<div class="outline-text-2" id="text-3">
<p>
Covers the remains of "Classes and Objects" from <a href="https://kotlinlang.org/docs/reference/data-classes.html">Data Classes</a> through <a href="https://kotlinlang.org/docs/reference/delegated-properties.html">Delegated
Properties</a>. It was on October 25 and was moderated by Terry.
</p>
</div>

<div id="outline-container-orged5458e" class="outline-3">
<h3 id="orged5458e"><span class="section-number-3">3.1</span> Data Classes</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><p>
Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2017-10-25 Wed 19:15] </span></span> <br />
Eric suggested that you would need the <code>componentN</code> functions to implement
destructuring. This seems right.
</p>

<p>
This is a data class. It's like a c <code>struct</code> I guess.
</p>
<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">User</span>(<span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">name</span>: <span style="color: #7CB8BB;">String</span>, <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">age</span>: <span style="color: #7CB8BB;">Int</span>)

<span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">main</span>(args: <span style="color: #7CB8BB;">Array&lt;String&gt;</span>) {
   <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">u</span> = <span style="color: #7CB8BB;">User</span>(<span style="color: #CC9393;">"Stan"</span>, 19)
   println(u)
}
</pre>
</div>

<p>
You get <code>toString()</code>, <code>equals()</code> and <code>hashCode()</code> for free. Similar to <code>defrecord</code> in
clojure I guess.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defrecord</span> <span style="color: #7CB8BB;">User</span> <span style="color: #BFEBBF;">[</span>name age<span style="color: #BFEBBF;">]</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">u</span> <span style="color: #BFEBBF;">(</span>-&gt;User <span style="color: #CC9393;">"Stan"</span> 19<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">or</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">u</span> <span style="color: #BFEBBF;">(</span>map-&gt;User <span style="color: #D0BF8F;">{</span><span style="color: #BFEBBF;">:name</span> <span style="color: #CC9393;">"Stan"</span> <span style="color: #BFEBBF;">:age</span> 19<span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>println u<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
I don't understand the purpose of the <code>componentN()</code> functions. I can't think if a
reason you'd need them. If you know the position of an argument, you almost certainly
also know it's name (e.g. <code>foo.field('fieldname')</code>, ala python). Otherwise, you just
want a comprehension of the fields (e.g. <code>foreach(foo.fields) {...}</code>). Maybe there is
some obscure case for this I'm not aware of.
</p></li>
</ul>
</div>
</div>


<div id="outline-container-org40d7c6b" class="outline-3">
<h3 id="org40d7c6b"><span class="section-number-3">3.2</span> Sealed Classes</h3>
<div class="outline-text-3" id="text-3-2">
<p>
These are like <code>enum</code> classes in java? but you can have multiple instances.
</p>

<div class="org-src-container">
<pre class="src src-kotlin">sealed <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Expr</span>
<span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Const</span>(<span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">number</span>: <span style="color: #7CB8BB;">Double</span>) : <span style="color: #7CB8BB;">Expr</span>()
<span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Sum</span>(<span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">e1</span>: <span style="color: #7CB8BB;">Expr</span>, <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">e2</span>: <span style="color: #7CB8BB;">Expr</span>) : <span style="color: #7CB8BB;">Expr</span>()
<span style="color: #F0DFAF; font-weight: bold;">object</span> <span style="color: #7CB8BB;">NotANumber</span> : <span style="color: #7CB8BB;">Expr</span>()

</pre>
</div>

<p>
I'm not sure how this is like an enum. It seems more like a marker interface (like
java's <code>Serializable</code>).
</p>
</div>
</div>

<div id="outline-container-orgf9f15b0" class="outline-3">
<h3 id="orgf9f15b0"><span class="section-number-3">3.3</span> Generics</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Kotlin infers generic parameters if possible:
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Box&lt;T&gt;</span>(t: <span style="color: #7CB8BB;">T</span>) {
        <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">value</span> = t
}

<span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">box</span> = <span style="color: #7CB8BB;">Box</span>(1)

<span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">It knows that the 1 is an Int</span>
</pre>
</div>

<p>
I've never been completely convinced of the value of generics especially as it relates
to inheritance relationships. As a result, this section kind of flows over my head a
bit. You have "declaration-site variance." Great!
</p>
</div>
