Notes.org
*** DONE Come back to this section
    CLOSED: [2017-10-25 Wed 19:24]
    SCHEDULED: <2017-10-25 Wed>

    - Note taken on [2017-10-25 Wed 19:44] \\
      Or not
** Nested Classes

    You can declare an inner class with =inner= but you don't have to.

    #+BEGIN_SRC kotlin
      class Outer {
              private val bar: Int = 1
              class Nested {
                      fun foo() = 2
              }
      }

      class Outer {
              private val bar: Int = 1
              inner class Nested {
                      fun foo() = bar
              }
      }
    #+END_SRC

    What's the difference? Do I need to declare =inner= to get access to =bar= from
    =Nested=?

** Enum Classes

    Ok, these look more like java enums.
    #+BEGIN_SRC kotlin
      enum class ProtocolState {
              WAITING {
                      override fun signal() = TALKING
              },
              TALKING {
                      override fun signal() = WAITING
              };

              abstract fun signal(): ProtocolState
      }
    #+END_SRC

    This is an enum with an anonymous class to implement a function =signal()=.

** Object Expressions and Declarations
    You can create an object in a local context as sort of a convenience measure

    #+BEGIN_SRC kotlin
      fun foo() {
              val adHoc = object {
                      var x: Int = 0
                      var y: Int = 0
              }
              print(adHoc.x + adHoc.y)
      }
    #+END_SRC


    Again, I'm not sure what is gained by this other than added complexity in the
    language.

    Object declarations are kotlin's way of doing singeltons.

    #+BEGIN_SRC kotlin
      object DataProviderManager {
              fun registerDataProvider(provider: DataProvider) {
                      //...
              }

              val allDataProviders: Collection<DataProvider>
              get() = //...
      }

      //refer to it like a static class...

      DataProviderManager.registerDataProvider(...)
    #+END_SRC

    You can also have an object declaration inside a class marked as =companion= which
    sort of works like static methods.

    #+BEGIN_SRC kotlin
      class MyClass {
              companion object Factory {
                      fun create(): MyClass = MyClass()
              }
      }


      //so I can say...

      val x = MyClass.create()
    #+END_SRC
* Session 4
  This will be on November 8 and will be moderated by me.
** [[https://kotlinlang.org/docs/reference/delegation.html][Class Delegation]]
   This is kind of cool. If you use the =by membervar= keyword you can delegate the
   methods in =membervar=

   #+BEGIN_SRC kotlin :tangle src/session4/Delegation.kt
     interface Base {
        fun print()
     }

     class BaseImpl(val x: Int) : Base {
        override fun print() { print(x) }
     }

     class Derived(b: Base) : Base by b


     fun main(args: Array<String>) {
        val b = BaseImpl(10)
        Derived(b).print()
     }

   #+END_SRC
