Notes.html

<div id="outline-container-org7ae8bdb" class="outline-4">
<h4 id="org7ae8bdb"><span class="section-number-4">3.3.1</span> <span class="done DONE">DONE</span> Come back to this section</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
SCHEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-10-25 Wed&gt;</span></span>
</p>

<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2017-10-25 Wed 19:44] </span></span> <br />
Or not</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf0b94e4" class="outline-3">
<h3 id="orgf0b94e4"><span class="section-number-3">3.4</span> Nested Classes</h3>
<div class="outline-text-3" id="text-3-4">
<p>
You can declare an inner class with <code>inner</code> but you don't have to.
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Outer</span> {
        <span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">bar</span>: <span style="color: #7CB8BB;">Int</span> = 1
        <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Nested</span> {
                <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">foo</span>() = 2
        }
}

<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Outer</span> {
        <span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">bar</span>: <span style="color: #7CB8BB;">Int</span> = 1
        <span style="color: #F0DFAF; font-weight: bold;">inner</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Nested</span> {
                <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">foo</span>() = bar
        }
}
</pre>
</div>

<p>
What's the difference? Do I need to declare <code>inner</code> to get access to <code>bar</code> from
<code>Nested</code>?
</p>
</div>
</div>

<div id="outline-container-orgc0713ec" class="outline-3">
<h3 id="orgc0713ec"><span class="section-number-3">3.5</span> Enum Classes</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Ok, these look more like java enums.
</p>
<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">enum</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">ProtocolState</span> {
        <span style="color: #7CB8BB;">WAITING</span> {
                <span style="color: #F0DFAF; font-weight: bold;">override</span> <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">signal</span>() = <span style="color: #7CB8BB;">TALKING</span>
        },
        <span style="color: #7CB8BB;">TALKING</span> {
                <span style="color: #F0DFAF; font-weight: bold;">override</span> <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">signal</span>() = <span style="color: #7CB8BB;">WAITING</span>
        };

        <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">signal</span>(): <span style="color: #7CB8BB;">ProtocolState</span>
}
</pre>
</div>

<p>
This is an enum with an anonymous class to implement a function <code>signal()</code>.
</p>
</div>
</div>

<div id="outline-container-org577f46a" class="outline-3">
<h3 id="org577f46a"><span class="section-number-3">3.6</span> Object Expressions and Declarations</h3>
<div class="outline-text-3" id="text-3-6">
<p>
You can create an object in a local context as sort of a convenience measure
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">foo</span>() {
        <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">adHoc</span> = <span style="color: #F0DFAF; font-weight: bold;">object</span> {
                <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">x</span>: <span style="color: #7CB8BB;">Int</span> = 0
                <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">y</span>: <span style="color: #7CB8BB;">Int</span> = 0
        }
        print(adHoc.x + adHoc.y)
}
</pre>
</div>


<p>
Again, I'm not sure what is gained by this other than added complexity in the
language.
</p>

<p>
Object declarations are kotlin's way of doing singeltons.
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">object</span> <span style="color: #7CB8BB;">DataProviderManager</span> {
        <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">registerDataProvider</span>(provider: <span style="color: #7CB8BB;">DataProvider</span>) {
                <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">...</span>
        }

        <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">allDataProviders</span>: <span style="color: #7CB8BB;">Collection&lt;DataProvider&gt;</span>
        get() = <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">...</span>
}

<span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">refer to it like a static class...</span>

<span style="color: #7CB8BB;">DataProviderManager.registerDataProvider</span>(...)
</pre>
</div>

<p>
You can also have an object declaration inside a class marked as <code>companion</code> which
sort of works like static methods.
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">MyClass</span> {
        <span style="color: #F0DFAF; font-weight: bold;">companion</span> <span style="color: #F0DFAF; font-weight: bold;">object</span> <span style="color: #7CB8BB;">Factory</span> {
                <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">create</span>(): <span style="color: #7CB8BB;">MyClass</span> = <span style="color: #7CB8BB;">MyClass</span>()
        }
}


<span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">so I can say...</span>

<span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">x</span> = <span style="color: #7CB8BB;">MyClass.create</span>()
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9a63d54" class="outline-2">
<h2 id="org9a63d54"><span class="section-number-2">4</span> Session 4</h2>
<div class="outline-text-2" id="text-4">
<p>
This will be on November 8 and will be moderated by me
</p>
</div>
<div id="outline-container-orgb6ab07d" class="outline-3">
<h3 id="orgb6ab07d"><span class="section-number-3">4.1</span> <a href="https://kotlinlang.org/docs/reference/delegation.html">Class Delegation</a></h3>
<div class="outline-text-3" id="text-4-1">
<p>
This is kind of cool. If you use the <code>by membervar</code> keyword you can delegate the
methods in <code>membervar</code>
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #7CB8BB;">Base</span> {
   <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">print</span>()
}

<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">BaseImpl</span>(<span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">x</span>: <span style="color: #7CB8BB;">Int</span>) : <span style="color: #7CB8BB;">Base</span> {
   <span style="color: #F0DFAF; font-weight: bold;">override</span> <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">print</span>() { print(x) }
}

<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Derived</span>(b: <span style="color: #7CB8BB;">Base</span>) : <span style="color: #7CB8BB;">Base</span> by b


<span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">main</span>(args: <span style="color: #7CB8BB;">Array&lt;String&gt;</span>) {
   <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">b</span> = <span style="color: #7CB8BB;">BaseImpl</span>(10)
   <span style="color: #7CB8BB;">Derived</span>(b).print()
}

</pre>
</div>
</div>
</div>
