Notes.org
** [[https://kotlinlang.org/docs/reference/delegated-properties.html][Delegated Properties]]
   This is a standardized way to enhance properties to give them shareable aspects. There
   are a few standard such delegates.

   - lazy() - Implements memoization of values (I think?)

     #+BEGIN_SRC kotlin :tangle src/session4/lazy.kt
       val lazyValue: String by lazy {
          println("computing...")
          "Hello"
       }

       fun main(args: Array<String>) {
          println(lazyValue)
          println(lazyValue)
       }

       //prints out the "computing..." the first time only.
     #+END_SRC

   - observable() - Allows you to pass a handler function to property that gets called
     after it is assigned.
     #+BEGIN_SRC kotlin :tangle src/session4/Observable.kt
       import kotlin.properties.Delegates
       class DUser {
          var name: String by Delegates.observable("<no name>") {
             prop, old, new ->
             println("I'll be changing $old to $new")
          }
       }

       fun main(args: Array<String>) {
          val user = DUser()
          user.name = "first"
          user.name = "second"
       }

     #+END_SRC

   - vetoable() - Same as observable but this runs before the assignment.

   - map() - Allows you to store properties in a map structure. This is good for
     marshalling/unmarshalling between kotlin objects and JSON.

     #+BEGIN_SRC kotlin :tangle src/session4/MapStore.kt
       class MUser(val map: Map<String, Any>) {
          val name: String by map
          val age: Int     by map
       }

       fun main(args: Array<String>) {
          val user = MUser(mapOf(
                "name" to "Johnny Foo",
                "age"  to 25
          ))

          println(user.name)
          println(user.age)
       }
     #+END_SRC
** [[https://kotlinlang.org/docs/reference/functions.html][Functions]]
   Functions are first class things in Kotlin.

   #+BEGIN_QUOTE
   When a function is called with both positional and named arguments, all the positional
   arguments should be placed before the first named one. For example, the call =f(1, y
   = 2)= is allowed, but =f(x = 1, 2)= is not.
   #+END_QUOTE

   There is an =infix= keyword that allows you to use a function call beteen its
   arguments.

   Tail recursion is allowed with a =tailrec= keyword. I'm not sure why you need the
   keyword. Wouldn't the compiler be able to figure this out?

** [[https://kotlinlang.org/docs/reference/lambdas.html][Lambdas]]
   Functions that take functions as arguments or return functions.

   #+BEGIN_SRC kotlin
     fun <T> lock(lock: Lock, body: () -> T): T {
        lock.lock()
        try {
           return body()
        } finally {
           lock.unlock()
        }
     }
   #+END_SRC

   This is a function that takes a parameter =body= that is itself a function. It is a
   function that has no arguments and returns a =T=. It can be a function reference or a
   lambda expression (inside curly braces).

   There are many shortcut ways of expressing functions that take functions as
   parameters. (too many?)


   Function literals with receivers allow you to call a function with a receiver object.

   #+BEGIN_SRC kotlin
     val sum = fun Int.(other: Int): Int = this + other

     // can be called like this

     100.sum(200)

     //300
   #+END_SRC

** [[https://kotlinlang.org/docs/reference/inline-functions.html][Inline Functions]]
   You can inline stuff if you want. (Shouldn't the compiler figure this shit out?)

   We can also =noinline= sections that have been inlined. You can also =crossinline= a
   function parameter if it is coming in from an object or an inner function in a nested
   function. (Good grief!)

** [[https://kotlinlang.org/docs/reference/coroutines.html][Coroutines]]
   An experimental feature of kotlin 1.1.

   A means by which you can avoid blocking on long operations. A suspended function is
   marked with the keyword =suspend=. A suspended function can only be called by another
   suspended function or coroutine. Normally this is started by supplying a suspend lambda
   in a function call.

   Coroutines are implemented as a [[https://en.wikipedia.org/wiki/Continuation-passing_style][continuation]].
