Notes.html
<div id="outline-container-orgd9462b6" class="outline-3">
<h3 id="orgd9462b6"><span class="section-number-3">4.2</span> <a href="https://kotlinlang.org/docs/reference/delegated-properties.html">Delegated Properties</a></h3>
<div class="outline-text-3" id="text-4-2">
<p>
This is a standardized way to enhance properties to give them shareable aspects. There
are a few standard such delegates.
</p>

<ul class="org-ul">
<li><p>
lazy() - Implements memoization of values (I think?)
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">lazyValue</span>: <span style="color: #7CB8BB;">String</span> by lazy {
   println(<span style="color: #CC9393;">"computing..."</span>)
   <span style="color: #CC9393;">"Hello"</span>
}

<span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">main</span>(args: <span style="color: #7CB8BB;">Array&lt;String&gt;</span>) {
   println(lazyValue)
   println(lazyValue)
}

<span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">prints out the "computing..." the first time only.</span>
</pre>
</div></li>

<li><p>
observable() - Allows you to pass a handler function to property that gets called
after it is assigned.
</p>
<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">import</span> <span style="color: #CC9393;">kotlin.properties.Delegates</span>
<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">DUser</span> {
   <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">name</span>: <span style="color: #7CB8BB;">String</span> by <span style="color: #7CB8BB;">Delegates.observable</span>(<span style="color: #CC9393;">"&lt;no name&gt;"</span>) {
      prop, old, new -&gt;
      println(<span style="color: #CC9393;">"I'll be changing </span><span style="color: #DFAF8F;">$old to $new</span><span style="color: #CC9393;">"</span>)
   }
}

<span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">main</span>(args: <span style="color: #7CB8BB;">Array&lt;String&gt;</span>) {
   <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">user</span> = <span style="color: #7CB8BB;">DUser</span>()
   user.name = <span style="color: #CC9393;">"first"</span>
   user.name = <span style="color: #CC9393;">"second"</span>
}

</pre>
</div></li>

<li>vetoable() - Same as observable but this runs before the assignment.</li>

<li><p>
map() - Allows you to store properties in a map structure. This is good for
marshalling/unmarshalling between kotlin objects and JSON.
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">MUser</span>(<span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">map</span>: <span style="color: #7CB8BB;">Map&lt;String</span>, <span style="color: #7CB8BB;">Any&gt;</span>) {
   <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">name</span>: <span style="color: #7CB8BB;">String</span> by map
   <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">age</span>: <span style="color: #7CB8BB;">Int</span>     by map
}

<span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #93E0E3;">main</span>(args: <span style="color: #7CB8BB;">Array&lt;String&gt;</span>) {
   <span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">user</span> = <span style="color: #7CB8BB;">MUser</span>(mapOf(
         <span style="color: #CC9393;">"name"</span> to <span style="color: #CC9393;">"Johnny Foo"</span>,
         <span style="color: #CC9393;">"age"</span>  to 25
   ))

   println(user.name)
   println(user.age)
}
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org73791ec" class="outline-3">
<h3 id="org73791ec"><span class="section-number-3">4.3</span> <a href="https://kotlinlang.org/docs/reference/functions.html">Functions</a></h3>
<div class="outline-text-3" id="text-4-3">
<p>
Functions are first class things in Kotlin.
</p>

<blockquote>
<p>
When a function is called with both positional and named arguments, all the positional
arguments should be placed before the first named one. For example, the call <code>f(1, y
   = 2)</code> is allowed, but <code>f(x = 1, 2)</code> is not.
</p>
</blockquote>

<p>
There is an <code>infix</code> keyword that allows you to use a function call beteen its
arguments.
</p>

<p>
Tail recursion is allowed with a <code>tailrec</code> keyword. I'm not sure why you need the
keyword. Wouldn't the compiler be able to figure this out?
</p>
</div>
</div>

<div id="outline-container-org4425524" class="outline-3">
<h3 id="org4425524"><span class="section-number-3">4.4</span> <a href="https://kotlinlang.org/docs/reference/lambdas.html">Lambdas</a></h3>
<div class="outline-text-3" id="text-4-4">
<p>
Functions that take functions as arguments or return functions.
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">fun</span> &lt;<span style="color: #7CB8BB;">T&gt;</span> lock(lock: <span style="color: #7CB8BB;">Lock</span>, body: () -&gt; <span style="color: #7CB8BB;">T</span>): <span style="color: #7CB8BB;">T</span> {
   lock.lock()
   <span style="color: #F0DFAF; font-weight: bold;">try</span> {
      <span style="color: #F0DFAF; font-weight: bold;">return</span> body()
   } <span style="color: #F0DFAF; font-weight: bold;">finally</span> {
      lock.unlock()
   }
}
</pre>
</div>

<p>
This is a function that takes a parameter <code>body</code> that is itself a function. It is a
function that has no arguments and returns a <code>T</code>. It can be a function reference or a
lambda expression (inside curly braces).
</p>

<p>
There are many shortcut ways of expressing functions that take functions as
parameters. (too many?)
</p>


<p>
Function literals with receivers allow you to call a function with a receiver object.
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #F0DFAF; font-weight: bold;">val</span> <span style="color: #DFAF8F;">sum</span> = <span style="color: #F0DFAF; font-weight: bold;">fun</span> <span style="color: #7CB8BB;">Int.</span>(other: <span style="color: #7CB8BB;">Int</span>): <span style="color: #7CB8BB;">Int</span> = <span style="color: #F0DFAF; font-weight: bold;">this</span> + other

<span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">can be called like this</span>

100.sum(200)

<span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">300</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4073eaa" class="outline-3">
<h3 id="org4073eaa"><span class="section-number-3">4.5</span> <a href="https://kotlinlang.org/docs/reference/inline-functions.html">Inline Functions</a></h3>
<div class="outline-text-3" id="text-4-5">
<p>
You can inline stuff if you want. (Shouldn't the compiler figure this shit out?)
</p>

<p>
We can also <code>noinline</code> sections that have been inlined. You can also <code>crossinline</code> a
function parameter if it is coming in from an object or an inner function in a nested
function. (Good grief!)
</p>
</div>
</div>

<div id="outline-container-orgf8aeeb4" class="outline-3">
<h3 id="orgf8aeeb4"><span class="section-number-3">4.6</span> <a href="https://kotlinlang.org/docs/reference/coroutines.html">Coroutines</a></h3>
<div class="outline-text-3" id="text-4-6">
<p>
An experimental feature of kotlin 1.1.
</p>

<p>
A means by which you can avoid blocking on long operations. A suspended function is
marked with the keyword <code>suspend</code>. A suspended function can only be called by another
suspended function or coroutine. Normally this is started by supplying a suspend lambda
in a function call.
</p>

<p>
Coroutines are implemented as a <a href="https://en.wikipedia.org/wiki/Continuation-passing_style">continuation</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Stan Dyck</p>
<p class="date">Created: 2017-11-08 Wed 12:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
